var randomIntArr = []
function myRandomInts(quantity, max){
  while(randomIntArr.length < quantity){
    var candidateInt = Math.floor(Math.random() * max);
    if(randomIntArr.indexOf(candidateInt) === -1) randomIntArr.push(candidateInt)
  }
}

function runConsole(){

let questionArray = [

    ["हाल ही मे ओडिशा ओपन का पहला संस्करण 2022 में किस शहर मे शुरू होगा है ?","बंगलुरु","कानपुर","भुवनेश्वर","कट्टक","कट्टक"],
    ["हाल ही मे चीन ने निम्न मे से किस राज्य के लापता किशोर मिराम तारोन को भारतीय सेना को वापस सौंप दिया है ?","सिक्किम","अरुणाचल प्रदेश","उत्तराखंड","हिमाचल प्रदेश","अरुणाचल प्रदेश"],
    ["गूगल ने हाल ही मे भारती एयरटेल में कितने बिलियन डॉलर का निवेश करने की घोषणा की है ?","$1 बिलियन","$2 बिलियन","$3 बिलियन","$4 बिलियन","$1 बिलियन"],
    ["हाल ही मे भारत सरकार के द्वारा आधिकारिक रूप से एयर इंडिया को टाटा समूह को किस दिन सौंपा गया ?","28 जनवरी","29 जनवरी","30 जनवरी","27 जनवरी","27 जनवरी"],
    ["हाल ही मे ने नेशनल इंस्टीट्यूट ऑफ फार्मास्युटिकल एजुकेशन एंड रिसर्च का रिसर्च पोर्टल (NIPER) को स्वास्थ मंत्री _______________ ने लॉन्च किया।","अर्जुन राम मेघवाल","अमित शाह","मनसुख मंडाविया","किरण रिजुजु","मनसुख मंडाविया"],
    ["हाल ही मे महान स्वतंत्रता सेनानी लाला लाजपत राय की 157वीं जयंती किस दिन मनाई गई ?","27 जनवरी","28 जनवरी","29 जनवरी","30 जनवरी","28 जनवरी"],
    ["डेटा गोपनीयता दिवस (Data Privacy Day) हाल ही मे किस दिन मनाया गया है।","27 जनवरी","28 जनवरी","29 जनवरी","30 जनवरी","28 जनवरी "],
    ["हाल ही मे किस केन्द्रीय मंत्री ने सचित्र कॉमिक बुक ‘इंडियाज वीमेन अनसंग हीरोज’ का विमोचन किया ?","खेल मंत्री अनुराग ठाकुर","कानून मंत्री किरण रिजुजु","विज्ञान मंत्री डॉ. जितेंद्र सिंह","संस्कृति राज्य मंत्री मीनाक्षी लेखी","संस्कृति राज्य मंत्री मीनाक्षी लेखी"],
    ["हाल ही मे कर्नाटक राज्य सरकार द्वारा कितने करोड़ की लागत से सैन्य स्कूल स्थापित किया जा रहा है ?","180","100","150","180","180"],
    ["हाल ही मे किस दिन अंतर्राष्ट्रीय सीमा शुल्क दिवस मनाया गया ?","27 जनवरी","28 जनवरी","26 जनवरी","24 जनवरी","26 जनवरी"],
    ["भारत द्वारा हाल ही मे 6.2 की तीव्रता वाले भुकंप से प्रभावित किस देश के लिए 2 लाख अमेरिकी डॉलर की राहत सहायता दी जाने की घोषणा की है ?","कनाडा","टोंगा","केन्या","आइसलैंड","टोंगा"],
    ["हाल ही मे अंतर्राष्ट्रीय प्रलय स्मरण दिवस किस दिन मनाया गया ?","28 जनवरी","29 जनवरी","30 जनवरी","27 जनवरी","27 जनवरी"],
    ["हाल ही मे लोकसभा अध्यक्ष ओम बिरला (Om Birla) ने किस दिन संसद के आधिकारिक मोबाइल एप्लिकेशन ‘डिजिटल संसद ऐप (Digital Sansad App)’ को लॉन्च किया है ?","27 जनवरी","28 जनवरी","26 जनवरी","24 जनवरी","27 जनवरी 22"],
    ["भारत सरकार ने हाल ही मे किसको अपना मुख्य आर्थिक सलाहकार नियुक्त किया है ?","वी आर विश्वेश्वर","डॉ वी अनंत नागेश्वरन","एस सीवन","अरविन्द सुब्रमण्यम","डॉ वी अनंत नागेश्वरन"],
    ["हाल ही मे नीति आयोग ने ग्रेट निकोबार में कितने करोड़ रुपए की एकीकृत परियोजना की शुरुआत की है ?","50,000 करोड़ रुपए","75,000 करोड़ रुपए","72,000 करोड़ रुपए","60,000 करोड़ रुपए","72,000 करोड़ रुपए"],
    ["निम्न मे से किस शिप्यार्ड ने हाल ही मे BSF को तीन फ्लोटिंग बॉर्डर आउट-पोस्ट जहाजों की डिलीवरी की है ?","गोवा शिप्यार्ड लिमिटेड","कोचीन शिप्यार्ड लिमिटेड","हिंदुस्तान शिप्यार्ड लिमिटेड","मझगांव डॉक लिमिटेड","कोचीन शिप्यार्ड लिमिटेड"],
    ["हाल ही मे निम्न मे से किस टाइगर रिजर्व को प्रतिष्ठित&nbsp;TX2 पुरस्कार&nbsp;दिया गया है ? जिसमे 2010&nbsp;से बाघों की संख्या दोगुनी होकर&nbsp;80&nbsp;हो गई है।","कान्हा टाइगर रिजर्व","कॉर्बेट टाइगर रिजर्व","सत्यमंगलम टाइगर रिजर्व","बान्दीपुर&nbsp;टाइगर रिज़र्व","सत्यमंगलम टाइगर रिजर्व"],
    ["हाल ही मे दिए गए कुल 189 पुलिस पदकों में से 115 पुलिस पदक वीरता (Police Medals for Gallantry – PMG) को किस राज्य की पुलिस ने हासिल किए हैं।","दिल्ली पुलिस","तमिलनाडु पुलिस","जम्मू व कश्मीर पुलिस","पंजाब पुलिस","जम्मू व कश्मीर पुलिस"],
    ["किस राज्य सरकार ने हाल ही मे 13 नए जिले बनाने की घोषणा की है ?","आंध्र प्रदेश","ओडिसा","अरुणाचल प्रदेश","केरल","आंध्र प्रदेश"],
    ["भारत ने तट आधारित एंटी-शिप मिसाइल सिस्टम के निर्यात के लिए किस देश के साथ $374.96 मिलियन के अनुबंध पर हस्ताक्षर किए ?","फिलीपींस","वियतनाम","लाओस","मलेसिया","फिलीपींस"],
    ["राष्ट्रीय बालिका दिवस (National Girl Child Day) हाल ही मे किस दिन मनाया गया ?","24 जनवरी","25 जनवरी","26 जनवरी","27 जनवरी","24 जनवरी"],
    ["किस देश की तकनीकी मदद से भारत के 150 गांवों को ‘विलेज ऑफ एक्सीलेंस’ में तब्दील करने की घोषणा की है ?","अमेरिका","इजराइल","इंग्लैंड","यू ए ई","इजराइल"],
    ["हाल ही मे भारतीय अंतरिक्ष अनुसंधान इसरो द्वारा किस अंतरिक्ष यान को इस साल सूर्य के अध्ययन करने के लिए लांच करने के लिए घोषणा की है ?","आदित्य L-1","आदित्य L-3","सूर्य 1","सूर्य 2","आदित्य L-1"],
    ["निम्न मे से किस राज्य के पूर्व सीएम और माकपा नेता बुद्धदेव भट्टाचार्य ने हाल ही मे पद्म भूषण पुरस्कार लेने से इनकार कर दिया किया ?","त्रिपुरा","पश्चिम बंगाल","असम","मेघालय","पश्चिम बंगाल"],
    ["हाल ही मे निम्न मे से किसके द्वारा सैन्य अभ्यास ‘पश्चिम लहर’ आयोजित किया गया ?","भारतीय सेना","भारतीय नौसेना","इंडियन कोस्ट गार्ड","भारतीय नौसेना","भारतीय नौसेना"],
    ["हाल ही मे इस साल के एशियाई खेलों का आयोजन की मेजबानी किस देश ने जीती है ?","चीन","जापान","भारत","दक्षिण कोरिया","चीन"],
    ["पुष्प कुमार जोशी हाल ही मे निम्न मे से किसके नए अध्यक्ष और प्रबंध निदेशक बनाये गए है ?","HPCL","BPCL","IOCL","NFC","HPCL"],
    ["हाल ही मे आए एक सर्वे के अनुसार किस भारतीय राज्य की महिलाएं एनेमिया से सबसे ज्यादा प्रभावित पाई गई हैं ?","आंध्र प्रदेश","अरुणाचल प्रदेश","असम","मेघालय","असम"],
    ["भारतीय नौसेना की हाल ही मे सेवामुक्त हुई आईएनएस खुकरी को किस केंद्र शशित प्रदेश के प्रशासन को सौंपा जाएगा ? जिसे संग्रहालय के रूप में विकसित किया जाना प्रस्तावित है।","पुडुचेरी प्रशासन","दीव प्रशासन","लक्षद्वीप प्रशासन","अंडमान प्रशासन","दीव प्रशासन"],
    ["हाल ही मे राष्ट्रीय पर्यटन दिवस किस दिन मनाया गया ?","24 जनवरी","25 जनवरी","26 जनवरी","27 जनवरी","25 जनवरी"],
    ["हाल ही मे DTH कंपनी ने अपने को rebrand करके क्या नाम रख लिया है ?","TATA प्लस","टाटा joy","TATA प्ले","TATA Universe","TATA प्ले"],
    ["हाल ही मे 12वां राष्ट्रीय मतदाता दिवस किस दिन मनाया गया है ?","24 जनवरी","25 जनवरी","26 जनवरी","27 जनवरी","25 जनवरी"],
    ["हाल ही मे जारी 2021 Corruption Perceptions Index मे भारत का कौन सा रैंक आया है ?","120 वां","85 वां","72 वां","132 वां","85 वां"],
    ["हाल ही में आयोजित हुई 9 वीं महिला राष्ट्रीय आइस हॉकी चैम्पियनशिप किस राज्य/केंद्र शासीत प्रदेश ने जीती है ?","सिक्किम","हिमाचल प्रदेश","जम्मू व कश्मीर","लदाक","लदाक"],
    ["हाल ही मे लॉन्च हुए जेम्स वेब टेलीस्कोप पृथ्वी से कितने मिलियन मील की दूरी पर अंतिम स्थिर स्थिति में पहुंचा चुका है ?","1 मिलियन","2 मिलियन","3 मिलियन","4 मिलियन","1 मिलियन"],
    ["हाल ही में किस भाषा की फिल्म कूझंगल&nbsp; को ढाका अंतर्राष्ट्रीय फिल्म महोत्सव में सर्वश्रेष्ठ फिल्म का पुरस्कार मिला ?","तेलुगु","तमिल","कन्नड","मलयालम","तमिल"],
    ["निम्न मे से किस केन्द्रीय मंत्री ने MyCGHS मोबाइल एप लांच किया है ?","शिक्षा मंत्री और कौशल विकास मंत्री धर्मेंद्र प्रधान","केंद्रीय संस्कृति और पर्यटन मंत्री जी. किशन रेड्डी","विज्ञान &amp; तकनीकी मंत्री डॉ जितेंद्र सिंह","स्वास्थ मंत्री मनसुख मंडविया","स्वास्थ मंत्री मनसुख मंडविया"],
    ["हाल ही में&nbsp;एयरटेल कंपनी ने बुलढाणा मे 21 मेगावाट की सौर इकाई शुरू की है। बुलढाणा भारत के किस राज्य मे स्थित है ?","राजस्थान","तेलंगाना","मध्य प्रदेश","महाराष्ट्र","महाराष्ट्र"],
    ["इनमे से किस राज्य ने 25 जनवरी को राज्य स्थापना दिवस मनाया है ?","अरुणाचल प्रदेश","हिमाचल प्रदेश","आंध्र प्रदेश","उत्तर प्रदेश","हिमाचल प्रदेश"],
    ["भारत और रूस के बीच हुए AK 203 सौदे के अंतर्गत हाल ही मे रूस द्वारा सशस्त्र बलों को कितने राइफलों का प्रारंभिक बैच डिलीवर किया गया है ?","50,000 राइफलों","60,000 राइफलों","70,000 राइफलों","80,000 राइफलों","70,000 राइफलों"],
    ["हाल ही मे किस देश के राष्ट्रपति सर्ज सरगस्यान ने इस्तीफा दे दिया दिया है ?","आर्मेनिया","जॉर्जिया","सायप्रस","बेलारूस","आर्मेनिया"],
    ["निम्न मे से किस महिला क्रिकेट खिलाड़ी को 2021 के लिए ICC महिला क्रिकेटर ऑफ द ईयर अवॉर्ड से सम्मानित किया गया है ?","स्मृति मंधाना","हरमनप्रीत कौर","मिताली राज","झूलन गोस्वामी","स्मृति मंधाना"],
    ["निम्न मे से किस व्यक्ति को असम सरकार ने ‘असम बैभव अवार्ड’ दिया है ?","रतन टाटा","अनिल अंबानी","गौतम अदानी","आनंद महिंद्रा","रतन टाटा"],
    ["भारत का पहला ग्राफीन नवाचार केंद्र किस राज्य मे स्थापित किया जाएगा ?","महाराष्ट्र","मध्य प्रदेश","केरल","तमिलनाडु","केरल"],
    ["हाल ही मे भारत की पहली पैरा बैडमिन्टन अकादमी किस शहर मे शुरू की गयी है ?","दिल्ली","लखनऊ","कोलकाता","गुरुग्राम","लखनऊ"],
    ["हाल ही में अंतर्राष्ट्रीय शिक्षा दिवस किस दिन मनाया गया ?","24 जनवरी","25 जनवरी","26 जनवरी","27 जनवरी","24 जनवरी"],
    ["हाल ही मे रूस-चीन-____________ ने संयुक्त नौसैनिक अभ्यास CHIRU-2Q22 आयोजित किया है।","उत्तर कोरिया","ईरान","पोलैंड","पाकिस्तान","ईरान"],
    ["निम्न मे से किस भारतीय हवाई अड्डे पर हाल ही मे DGCA द्वारा 20 लाख का जुर्माना लगाया गया है ?","दिल्ली अंतर्राष्ट्रीय हवाई अड्डा","मुंबई अंतर्राष्ट्रीय हवाई अड्डा","कोलकाता अंतर्राष्ट्रीय हवाई अड्डा","चेन्नई अंतर्राष्ट्रीय हवाई अड्डा","कोलकाता अंतर्राष्ट्रीय हवाई अड्डा"],
    ["इनमे से किस पदक से ओलंपियन नीरज चोपड़ा (Neeraj Chopra) को गणतंत्र दिवस की पूर्व संध्या पर राष्ट्रपति राम नाथ कोविंद (Ram Nath Kovind) द्वारा सम्मानित किया गया ?","परम विशिष्ट सेवा पदक","विशिष्ट सेवा पदक","अति विशिष्ट सेवा पदक","सेना पदक","परम विशिष्ट सेवा पदक"],
    [" हाल ही में भारत ने 26 जनवरी 2022 को अपना कितना वां गणतंत्र दिवस मनाया है ?","72वां","73वां","74वां","75वां","73वां गणतंत्र दिवस मनाया है"],
    ["भारत मे हर साल Beating Retreat समारोह किस दिन मनाया जाता है ?","26 जनवरी","27 जनवरी","28 जनवरी","29 जनवरी","29 जनवरी"],
]

  var str = "";

    for (let i=0; i<40; i++){

        let j = i+1;
        i = randomIntArr[i];

        str+= `<div class="border border-secondary m-2 hidden-tab">
        <p class="border bg-info bg-opacity-25 p-3 m-2 fst-italic">This is reference Text.</p>

        <p class="border bg-secondary bg-opacity-25 p-3 m-2 fw-bold">`+questionArray[i][0]+`</p>

      <div class="m-2 pt-3">
        <div class="row m-0 p-0 justify-content-around">

          <div class="col-lg-6 mb-3">
            <input type="radio" class="btn-check" name="btnradio`+j+`" id="btnradio1`+j+`" autocomplete="off" value="1">
            <label class="btn btn-outline-success d-flex no-shadow" for="btnradio1`+j+`" onclick="answerStatus()">`+questionArray[i][1]+`</label>
          </div>


          <div class="col-lg-6 mb-3">
            <input type="radio" class="btn-check" name="btnradio`+j+`" id="btnradio2`+j+`" autocomplete="off" value="2">
            <label class="btn btn-outline-success d-flex no-shadow" for="btnradio2`+j+`" onclick="answerStatus()">`+questionArray[i][2]+`</label>
          </div>

          <div class="col-lg-6 mb-3">
            <input type="radio" class="btn-check" name="btnradio`+j+`" id="btnradio3`+j+`" autocomplete="off" value="3">
            <label class="btn btn-outline-success d-flex no-shadow" for="btnradio3`+j+`" onclick="answerStatus()">`+questionArray[i][3]+`</label>
          </div>

          <div class="col-lg-6 mb-3">
            <input type="radio" class="btn-check" name="btnradio`+j+`" id="btnradio4`+j+`" autocomplete="off" value="4">
            <label class="btn btn-outline-success d-flex no-shadow" for="btnradio4`+j+`" onclick="answerStatus()">`+questionArray[i][4]+`</label>
          </div>

        </div>
      </div>
      
      </div>`

      i = j-1;
    }

  document.getElementById("quiz").innerHTML = str;
}

